//---------------------------------------------------------------------------
#include "Properties.h"
//---------------------------------------------------------------------------
#pragma package(smart_init)
//---------------------------------------------------------------------------
//Конструктор
TPercentageAccuracy::TPercentageAccuracy()
	: TAbstractValue(40081)
{

}
//---------------------------------------------------------------------------
//Деструктор
TPercentageAccuracy::~TPercentageAccuracy()
{

}

