//---------------------------------------------------------------------------
#include "Properties.h"
//---------------------------------------------------------------------------
#pragma package(smart_init)
//---------------------------------------------------------------------------
//Конструктор
TPreviousEnteredValue::TPreviousEnteredValue()
	: TAbstractValue(40082)
{

}
//---------------------------------------------------------------------------
//Деструктор
TPreviousEnteredValue::~TPreviousEnteredValue()
{

}


