//---------------------------------------------------------------------------
#include "ProtocolsClass.h"
//---------------------------------------------------------------------------
#pragma package(smart_init)
//---------------------------------------------------------------------------
//Конструктор
TProtocols::TProtocols()
{
	ModbusProtocol = new TModbusProtocol;
}
//---------------------------------------------------------------------------
//Деструктор
TProtocols::~TProtocols()
{
	delete ModbusProtocol;
}
//---------------------------------------------------------------------------
std::vector< std::vector<unsigned char> > TProtocols::GetPatterns()
{
	//когда кроме модбаса будет что-то ещё, здесь нужно будет объединять паттерны от разных приборов
    return ModbusProtocol->GetPatterns();
}
